{"basics":{"name":"Eduardo Adame Salles","label":"Data Scientist","image":"","email":"eadamesalles@gmail.com","url":"https://adamesalles.github.io","summary":"I am an individual with a passion for learning things that can help people.\nSince my early years, I have been keenly interested in technology, programming, and mathematics. At 14, I joined the Federal Center for Technological Education Celso Suckow da Fonseca (CEFET/RJ), where I gained experience as a teaching assistant and project leader even before starting my undergraduate studies.\nDuring my technical course, I focused on structural analysis, computational mechanics, and robotics.\nI was the captain and founding member of the leading drone team in the state of Rio de Janeiro, ranking 8th nationally in the Formula Drone SAE Brazil competition, with about 50 competitors.\nDuring this time, I also participated in several national knowledge olympiads and received numerous awards, notably in the OBMEP, the world's largest student olympiad, reaching over 18 million students and more than 47,000 schools.\nI have some experience in creating educational materials such as courses and textbooks.\nAt FGV, I have fully embraced teaching opportunities and have two years of experience as a teaching assistant.\nFor two years, I have been part of the Scientific Initiation and Master's Program, meaning that upon completing my undergraduate degree, I had already fulfilled the credits required for a master's degree, with only the thesis remaining.\nIn terms of research, I have been working on exact sampling from historical data bayesian models (mainly Power prior) under the supervision of  Professor Luiz Max de Carvalho.\nFurthermore, since February 2023, I have been temporarily employed as a consultant and research assistant for The World Bank, where I engaged in data collection and processing, as well as the implementation and adjustment of econometric models using PyTorch.","location":{"address":"190 Praia de Botafogo","postalCode":"22250-900","city":"Rio de Janeiro","countryCode":"BR","region":"RJ"},"profiles":[{"network":"Twitter","username":"eadamesalles","url":"https://twitter.com/eadamesalles"}]},"work":[{"name":"The World Bank","position":"Consultant / Research Assistant","url":"https://www.worldbank.org/","startDate":"2023-02-01","endDate":"2025-06-30","summary":"I work in developing, applying, improving, and optimizing econometric models for geospatial land use data in Latin America and the Caribbean (LAC). This project is supervised by Professors Marcelo Sant'Anna (FGV EPGE), Rafael Araújo (FGV EESP), and Francisco Costa (University of Delaware). Currently, we are handling a dataset comprising tens of millions of entries, for which I am also responsible for data cleaning and processing. I primarily use PyTorch for scalability with NVIDIA CUDA. This contract is expected to last until April 2024.","highlights":["PyTorch","Statistics","Econometrics"]}],"education":[{"institution":"School of Applied Mathematics, Getulio Vargas Foundation, Rio de Janeiro, Brazil","location":"Brazil","url":"https://emap.fgv.br/en","area":"Applied Mathematics","studyType":"MS. in Applied Mathematics and Data Science","startDate":"2025-02-17","endDate":"today","score":"A","courses":["Real Analysis","Numerical Analysis","Computational Statistics","Causal Inference","Stochastic Calculus","Statistical Inference","Quantitative Biology"]},{"institution":"School of Applied Mathematics, Getulio Vargas Foundation, Rio de Janeiro, Brazil","location":"Brazil","url":"https://emap.fgv.br/en","area":"Data Science","studyType":"BS. in Data Science and Artificial Intelligence","startDate":"2021-01-01","endDate":"2024-12-06","score":"9.32","courses":["Real Analysis","Numerical Analysis","Computational Statistics","Causal Inference","Stochastic Calculus","Statistical Inference","Quantitative Biology"]}],"awards":[{"title":"ICIAM Fellowship CNMAC 2024","date":"2024","awarder":"International Council for Industrial and Applied Mathematics (ICIAM)","summary":"Work: 'Shape-contrained function emulation with Gaussian processes'"},{"title":"Scientific Initiation scholarship","date":"2023","awarder":"National Institute of Mathematics Science and Technology (INCTMat)","url":"https://impa.br/noticias/inctmat-divulga-lista-de-contemplados-com-bolsas-de-iniciacao-cientifica/","summary":"Project: 'Shape-constrained Gaussian Processes'"},{"title":"Silver Medal","date":"2022","awarder":"Elon Lages Competition, Brazilian Mathematical Olympiad (OBM)","url":"https://www.obm.org.br/premiados-3a-competicao-elon-lages-lima-de-matematica-2022/"},{"title":"Gold Medal (1st Place)","date":"2021","awarder":"Science, Technology and Innovation Fair of the State of Rio de Janeiro (FECTI)","url":"https://www.cecierj.edu.br/2021/12/04/xv-fecti-divulga-lista-de-premiacao-que-ocorreu-neste-sabado/"},{"title":"Silver Medal","date":"2019","awarder":"Brazilian Mathematical Olympiad of Public Schools (OBMEP)","url":"https://premiacao.obmep.org.br/2019/verRelatorioPremiadosPrata.do.htm"},{"title":"Bronze Medal","date":"2018","awarder":"Brazilian Mathematical Olympiad of Public Schools (OBMEP)","url":"https://premiacao.obmep.org.br/2018/verRelatorioPremiadosBronze.do.htm"}],"skills":[{"name":"Statistics","level":"Master","icon":"fa-solid fa-hashtag","keywords":["Statistical Inference","Computational Statistics","Machine Learning","Causality"]},{"name":"Programming","level":"Master","icon":"fa-solid fa-hashtag","keywords":["Python","R","Julia","C++"]}],"languages":[{"language":"Portuguese","fluency":"Native speaker","icon":""},{"language":"English","fluency":"Fluent","icon":""},{"language":"Spanish","fluency":"Intermediate","icon":""},{"language":"Mandarin Chinese","fluency":"Basic","icon":""}],"interests":[{"name":"Statistics","icon":"fa-solid fa-tag","keywords":["Probabilistic Machine Learning","Bayesian Statistics","Gaussian processes","Stochastic simulation","Causal Inference"]},{"name":"Computer Science","icon":"fa-solid fa-tag","keywords":["Linux","LaTeX","Git/Github","Docker","Web development"]}],"references":[{"name":"Prof. Luiz Max Carvalho, PhD.","icon":"fa-solid fa-thumbtack","reference":"- <a href='https://github.com/maxbiostat'>Homepage</a>; <br> - <a href='mailto:luiz.fagundes@fgv.br' target='_blank'> E-mail</a>."},{"name":"Prof. Yuri Saporito, PhD.","icon":"fa-solid fa-thumbtack","reference":"- <a href='https://yurisaporito.com'>Homepage</a>; <br> - <a href='mailto:yuri.saporito@fgv.br' target='_blank'> E-mail</a>."},{"name":"Prof. Guilherme T. Goedert, PhD.","icon":"fa-solid fa-thumbtack","reference":"- <a href='https://gtgoedert.com'>Homepage</a>; <br> - <a href='mailto:guilherme.goedert@fgv.br' target='_blank'> E-mail</a>."},{"name":"Prof. Flávio Bambirra Gonçalves, PhD.","icon":"fa-solid fa-thumbtack","reference":"- <a href='https://est.ufmg.br/~fbgoncalves/'>Homepage</a>; <br> - <a href='mailto:fbgoncalves@est.ufmg.br' target='_blank'> E-mail</a>."}],"projects":[{"name":"Shape-constrained Gaussian Processes","summary":"The use of Gaussian processes is a powerful technique for estimating functions which cannot be evaluated across their entire domain, allowing for the quantification of estimation uncertainties, especially when following the Bayesian paradigm. However, when we have prior knowledge about the shape properties of a function, especially its derivatives, it is possible to enhance the quality of our estimates. This project focuses on the development and application of shape-constrained Gaussian processes to improve function estimation. Supervised by Professor Luiz Max de Carvalho, PhD.","highlights":["Gaussian processes","Bayesian statistics","Shape-constrained estimation"],"startDate":"2023-10","endDate":"2024-12","url":"https://github.com/adamesalles/shape-constrained-gaussian-processes"},{"name":"A Bayesian approach to understanding the Homicide Rate in the City of Rio de Janeiro by administrative regions through their Social Progress Index indicators","summary":"This study aims to investigate the relationship between the homicide rate in the city of Rio de Janeiro and the indicators of the Social Progress Index. Our approach involves employing Bayesian methodology to estimate the parameters of three multilevel models and subsequently comparing their performance. The Social Progress Index serves as a measure of the overall quality of life and social well-being of the population, and it has been regularly published by the Pereira Passos Institute for the City of Rio de Janeiro biennially since 2016. Given the well-known issue of violence in Rio de Janeiro, the homicide rate serves as a pertinent indicator of this problem. The city is divided into 33 administrative regions, and we utilize the corresponding data throughout this research.","highlights":["Bayesian statistics","Multilevel models","Social Progress Index"],"startDate":"2023-05","endDate":"2023-05","url":"https://github.com/adamesalles/homicide-rate-rj"},{"name":"Gaussian Processes Visual Tool","summary":"This paper presents the Gaussian Processes Visual Tool, an interactive tool for visualizing Gaussian Processes (GPs). The tool combines the power of Svelte, D3.js, Flask, and GPyTorch to provide a flexible and user-friendly interface. With the Gaussian Processes Visual Tool, users can visualize and understand GPs, make observations, and explore various kernel functions. The tool offers simulation options, allowing users to set axis parameters, likelihood variance, and even upload custom datasets. It stands out for its aesthetic design, comprehensive functionalities, and the integration of multiple important technologies. The Gaussian Processes Visual Tool fills a gap by offering a beautiful and useful tool that combines all essential GP functions in one place.","highlights":["Gaussian processes","Bayesian statistics","Interactive visualization"],"startDate":"2023-05","endDate":"2023-05","url":"https://github.com/adamesalles/gp-visual-tool"},{"name":"Voyager’s Journey: an interactive visualization of NASA’s mission through the solar system","summary":"Joint work with Juan Belieni (FGV EMAp) and Marcelo Amaral (FGV EMAp). TThis article presents an interactive visualization using web technologies of the Voyager program by showing, for each probe, a simulation of the Solar System, containing the probe’s position for each day, the main events of the mission inside a timeline and a gallery of images captured by them. The visualization is controllable by a player, which offers the option to play, pause, change the speed and reset the whole visualization.","highlights":["D3.js","NASA's Voyager program","Interactive visualization"],"startDate":"2023-05","endDate":"2023-05","url":"https://fgv-vis-2023.github.io/final-project-voyagers-journey/"}]}